src/main/java/ui/itrack.html

<?xml version="1.0" encoding="utf-8" ?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:int="http://ITrack.Transmission/2011/02/25/Interfaces" xmlns:mes="http://ITrack.Transmission/2011/02/25/Messages" xmlns:obj="http://ITrack.Transmission/2011/02/25/Objects"><soap:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Action>http://ITrack.Transmission/2011/02/25/Interfaces/TransmissionServer/StoreDocument</wsa:Action></soap:Header><soap:Body><int:StoreDocument><int:StoreDocumentMessage><mes:SystemCode>PWSTCO</mes:SystemCode><mes:TransmissionUID>1764-FA-2016-200062-84</mes:TransmissionUID><mes:DocumentSection><obj:DocumentType>2</obj:DocumentType><obj:DocumentNumber>200062</obj:DocumentNumber><obj:CreationDateTimeUTC>2024-01-03 14:59:07 +04:00</obj:CreationDateTimeUTC><obj:DocumentStatus>2</obj:DocumentStatus><obj:LatestGoodIssueDate>2024-01-03 14:59:07 +04:00</obj:LatestGoodIssueDate><obj:OrderedProducts><obj:OrderedProductSection><obj:ProductCode>FA080539.00</obj:ProductCode><obj:OrderedQuantity>12000</obj:OrderedQuantity></obj:OrderedProductSection></obj:OrderedProducts><obj:StockOwnerSection><obj:StockOwnerCode>1764</obj:StockOwnerCode><obj:StockOwnerName>COMPANIA COLOMBIANA DE TABACO S.A.S</obj:StockOwnerName><obj:StockOwnerAddress1>Cra. 52 No. 4-96 Av. Guayabal</obj:StockOwnerAddress1><obj:StockOwnerZIP>050024</obj:StockOwnerZIP><obj:StockOwnerCity>Medellin</obj:StockOwnerCity><obj:StockOwnerCountry>CO</obj:StockOwnerCountry><obj:StockOwnerGLN>0</obj:StockOwnerGLN></obj:StockOwnerSection><obj:DestinationSection><obj:DestinationCode>1558607</obj:DestinationCode><obj:DestinationName>LICORES COCO BONGO</obj:DestinationName><obj:DestinationAddress1>CL 91 # 28D2 - 05 CL 91 # 28D2 - 05</obj:DestinationAddress1><obj:DestinationZIP>76001</obj:DestinationZIP><obj:DestinationCity>CALI</obj:DestinationCity><obj:DestinationCountry>CO</obj:DestinationCountry></obj:DestinationSection><obj:SoldToSection><obj:SoldToCode>1558607</obj:SoldToCode><obj:SoldToName>LICORES COCO BONGO</obj:SoldToName><obj:SoldToAddress1>CL 91 # 28D2 - 05 CL 91 # 28D2 - 05</obj:SoldToAddress1><obj:SoldToZIP>76001</obj:SoldToZIP><obj:SoldToCity>CALI</obj:SoldToCity><obj:SoldToCountry>CO</obj:SoldToCountry><obj:SoldToGLN>0</obj:SoldToGLN><obj:SoldToSameGroupAsStockOwner>0</obj:SoldToSameGroupAsStockOwner></obj:SoldToSection><obj:TrackingLocationSection><obj:TrackingLocationCode>CO54</obj:TrackingLocationCode><obj:TrackingLocationName>CO Cali CD</obj:TrackingLocationName><obj:TrackingLocationAddress1>Calle 15 #32-234, Bodega B6-B5A, Complejo Carvajal (Yumbo - Vall</obj:TrackingLocationAddress1><obj:TrackingLocationZIP>760502</obj:TrackingLocationZIP><obj:TrackingLocationCity>YUMBO</obj:TrackingLocationCity><obj:TrackingLocationCountry>CO</obj:TrackingLocationCountry></obj:TrackingLocationSection></mes:DocumentSection></int:StoreDocumentMessage></int:StoreDocument></soap:Body></soap:Envelope>